Tekla.Structures.ModelInternal.PropertyDefinition
Represents a Property Definition data class.

Tekla.Structures.ModelInternal.PropertyDefinition.Id
The PropertyDefinition definition identifier

Tekla.Structures.ModelInternal.PropertyDefinition.PropertySetDefinitionId
The PropertySetDefinition  identifier

Tekla.Structures.ModelInternal.PropertyDefinition.Name
The PropertyDefinition name

Tekla.Structures.ModelInternal.PropertyDefinition.Description
The PropertyDefinition description

Tekla.Structures.ModelInternal.PropertyDefinition.Type
The PropertyDefinition type

Tekla.Structures.ModelInternal.PropertyDefinition.DefaultValues
The PropertyDefinition values

Tekla.Structures.ModelInternal.PropertyDefinition.Enum
The PropertyDefinition enum

Tekla.Structures.ModelInternal.PropertyDefinition.Items
Type of the items from list

Tekla.Structures.ModelInternal.PropertyDefinition.Format
The format for the type string Property.

Tekla.Structures.ModelInternal.PropertyDefinition.Required
True if the boolean has include unknown.

Tekla.Structures.ModelInternal.PropertyDefinition.Version
The Property Definition version